# Replacing values

In [1]:
import pandas as pd

In [3]:
raw_data = {'citi':['a','b','c','d'],
            'rank':[1,2,3,4],
            'score':[11,12,13,14]
           }
data = pd.DataFrame(raw_data, 
                    index = pd.Index([1,2,3,4], name = 'Numbers'),
                    columns = pd.Index(['citi','rank','score'], name = 'Attributes'))

In [4]:
data

Attributes citi  rank  score
Numbers
1             a     1     11
2             b     2     12
3             c     3     13
4             d     4     14

In [6]:
data['citi']

Numbers
1    a
2    b
3    c
4    d
Name: citi, dtype: object

In [7]:
data.replace('c','x')

Attributes citi  rank  score
Numbers
1             a     1     11
2             b     2     12
3             x     3     13
4             d     4     14

In [9]:
data.replace([11,12,13,14],[110,120,130,140], inplace=True)

In [10]:
data

Attributes citi  rank  score
Numbers
1             a     1    110
2             b     2    120
3             c     3    130
4             d     4    140

In [17]:
data.iloc[2][2]
# lets duplicate some data
data.replace([130,140],[120,120], inplace=True)

In [18]:
data.score.duplicated()

Numbers
1    False
2    False
3     True
4     True
Name: score, dtype: bool

In [19]:
data.score.duplicated().sum()

2

In [30]:
d2 = data.append({'citi':'d','rank':4,'score':120}, ignore_index=True)

In [27]:
data

Attributes citi  rank  score
Numbers
1             a     1    110
2             b     2    120
3             c     3    120
4             d     4    120

In [31]:
d2

  citi  rank  score
0    a     1    110
1    b     2    120
2    c     3    120
3    d     4    120
4    d     4    120

In [32]:
d2.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [36]:
d2.loc[d2.duplicated()]

  citi  rank  score
4    d     4    120

In [37]:
d2.loc[d2.duplicated(keep='first')]

  citi  rank  score
4    d     4    120

In [40]:
d3 = d2.drop_duplicates()

In [41]:
print(d2)
print(d3)

  citi  rank  score
0    a     1    110
1    b     2    120
2    c     3    120
3    d     4    120
4    d     4    120
  citi  rank  score
0    a     1    110
1    b     2    120
2    c     3    120
3    d     4    120

In [42]:
d4 = d3.append({'citi':'d','rank':4,'score':110},ignore_index=True)

In [43]:
d4

  citi  rank  score
0    a     1    110
1    b     2    120
2    c     3    120
3    d     4    120
4    d     4    110

In [44]:
d4.duplicated(subset=['citi','rank'])

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [46]:
d4.drop_duplicates(subset=['citi','rank'])

  citi  rank  score
0    a     1    110
1    b     2    120
2    c     3    120
3    d     4    120